# Load library

In [1]:
import pandas as pd

pd.options.display.float_format = '{:,.2f}'.format

# Load Data

In [2]:
df = pd.read_excel('Chapter4_Figure4pt4_DataOnly.xlsx')

In [3]:
df

            ID  VendorNum       Date        InvNum  Amount
0            1       2001 2010-01-01       4242J10   25.19
1            2       2001 2010-01-01       7899J10   25.86
2            3       2001 2010-01-01       3830J10   26.57
3            4       2001 2010-01-01       9514J10   27.83
4            5       2001 2010-01-01       6296J10   28.09
...        ...        ...        ...           ...     ...
189465  189466      52935 2010-07-01  270221266736   33.46
189466  189467      52936 2010-07-01  270348386110   61.52
189467  189468      52937 2010-02-01  271253401514   12.36
189468  189469      52938 2010-02-01  261715090450    8.02
189469  189470      52939 2010-02-01  270241460335   16.30

[189470 rows x 5 columns]

# Large Number

In [4]:
largenumber = df[df['Amount']>= 10][['ID', 'Amount']]

In [5]:
largenumber

            ID  Amount
0            1   25.19
1            2   25.86
2            3   26.57
3            4   27.83
4            5   28.09
...        ...     ...
189464  189465   11.88
189465  189466   33.46
189466  189467   61.52
189467  189468   12.36
189469  189470   16.30

[177763 rows x 2 columns]

In [6]:
data = largenumber.groupby('Amount', as_index=False).count()
data

             Amount   ID
0             10.00  221
1             10.01    3
2             10.02    4
3             10.03    7
4             10.04    5
...             ...  ...
64574  3,069,846.95    1
64575  5,990,958.38    1
64576 14,495,142.32    1
64577 15,779,215.20    1
64578 26,763,475.78    1

[64579 rows x 2 columns]

In [7]:
data.rename(columns={'ID': 'Count'}, inplace=True)

In [8]:
data

             Amount  Count
0             10.00    221
1             10.01      3
2             10.02      4
3             10.03      7
4             10.04      5
...             ...    ...
64574  3,069,846.95      1
64575  5,990,958.38      1
64576 14,495,142.32      1
64577 15,779,215.20      1
64578 26,763,475.78      1

[64579 rows x 2 columns]

In [9]:
data.sort_values(by='Count', ascending=False, inplace=True)

In [10]:
data

             Amount  Count
3832          50.00   6022
41757      1,153.35   2264
40959      1,083.45   1185
12039        150.00   1056
39720        988.35   1018
...             ...    ...
32284        606.39      1
32286        606.41      1
32287        606.47      1
32290        606.78      1
64578 26,763,475.78      1

[64579 rows x 2 columns]

In [11]:
data['FirstTwo'] = data['Amount'].astype(str).str[:2].astype('int64')
data

             Amount  Count  FirstTwo
3832          50.00   6022        50
41757      1,153.35   2264        11
40959      1,083.45   1185        10
12039        150.00   1056        15
39720        988.35   1018        98
...             ...    ...       ...
32284        606.39      1        60
32286        606.41      1        60
32287        606.47      1        60
32290        606.78      1        60
64578 26,763,475.78      1        26

[64579 rows x 3 columns]

In [12]:
data['Rank'] = range(1, data.shape[0] + 1)
data

             Amount  Count  FirstTwo   Rank
3832          50.00   6022        50      1
41757      1,153.35   2264        11      2
40959      1,083.45   1185        10      3
12039        150.00   1056        15      4
39720        988.35   1018        98      5
...             ...    ...       ...    ...
32284        606.39      1        60  64575
32286        606.41      1        60  64576
32287        606.47      1        60  64577
32290        606.78      1        60  64578
64578 26,763,475.78      1        26  64579

[64579 rows x 4 columns]

In [13]:
data.reset_index(inplace=True)
data

       index        Amount  Count  FirstTwo   Rank
0       3832         50.00   6022        50      1
1      41757      1,153.35   2264        11      2
2      40959      1,083.45   1185        10      3
3      12039        150.00   1056        15      4
4      39720        988.35   1018        98      5
...      ...           ...    ...       ...    ...
64574  32284        606.39      1        60  64575
64575  32286        606.41      1        60  64576
64576  32287        606.47      1        60  64577
64577  32290        606.78      1        60  64578
64578  64578 26,763,475.78      1        26  64579

[64579 rows x 5 columns]

In [14]:
data.head(20)[['Rank', 'Count', 'Amount', 'FirstTwo']]

    Rank  Count   Amount  FirstTwo
0      1   6022    50.00        50
1      2   2264 1,153.35        11
2      3   1185 1,083.45        10
3      4   1056   150.00        15
4      5   1018   988.35        98
5      6    976 1,159.35        11
6      7    956    25.00        25
7      8    938    90.00        90
8      9    907   928.45        92
9     10    729   994.35        99
10    11    672    30.00        30
11    12    657   250.00        25
12    13    631   200.00        20
13    14    624   100.00        10
14    15    617   300.00        30
15    16    602    45.00        45
16    17    578 1,118.40        11
17    18    565 1,318.35        13
18    19    559   964.40        96
19    20    517 1,018.30        10

# Small Number

In [14]:
smallnumber = df[(df['Amount'] > 0) & (df['Amount']< 10)][['ID', 'Amount']]
data = smallnumber.groupby('Amount', as_index=False).count()
data.rename(columns={'ID': 'Count'}, inplace=True)
data.sort_values(by='Count', ascending=False, inplace=True)
data['FirstTwo'] = data['Amount'].astype(str).str[:1].astype('int64')
data['Rank'] = range(1, data.shape[0] + 1)
data.reset_index(inplace=True)
data.head(20)[['Rank', 'Count', 'Amount', 'FirstTwo']]

    Rank  Count  Amount  FirstTwo
0      1    204    5.25         5
1      2    152    9.38         9
2      3    145    6.45         6
3      4    144    0.29         0
4      5    130    5.00         5
5      6    118    2.35         2
6      7    110    4.40         4
7      8    100    6.25         6
8      9    100    0.59         0
9     10     91    0.91         0
10    11     77    8.80         8
11    12     77    5.95         5
12    13     76    4.69         4
13    14     67    0.36         0
14    15     66    4.22         4
15    16     65    3.50         3
16    17     62    8.47         8
17    18     61    3.82         3
18    19     60    7.27         7
19    20     55    3.62         3